//=============================================================================
//
// ステージ遷移処理 [stage.h]
// Author : GP11B243 24 人見友基
//
// タイトル・ゲーム・リザルトの遷移管理
//
//=============================================================================
#ifndef _STAGE_H_
#define _STAGE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define START_STAGE		(STAGE_TITLE)	// 開始時のステージ

/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* 列挙型定義
*******************************************************************************/
enum
{	// ステージ
	STAGE_TITLE,
	STAGE_GAME,
	STAGE_RESULT,
	STAGE_MAX
};

enum
{
	STAGE_INIT_FAST,
	STAGE_INIT_LOOP
};

enum
{
	STAGE_WIN_NON,
	STAGE_WIN_1P,
	STAGE_WIN_2P
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT		InitStage(HINSTANCE hInstance, HWND hWnd);
HRESULT		InitStageEach(int nType);
void		UninitStage(void);
void		UpdateStage(void);
void		DrawStage(void);

void		SetStage(int nStage);
int			GetStage(void);

void		SetStageWinPlayer(int nPlayer);
int			GetStageWinPlayer(void);

#endif